app/Http/Controllers/testApiController.php

public function index()
{
    $data =   UserCollection::collection(User::all())->additional([
        'success' =>true,
        'code' =>200
    ]);
---
select * from `users`

public function store(userRequest $rq)
{

 $user = new User();
 $users = $user->where('email' ,$rq->email)->first();

 if($users){
    return response()->json([
        'success'=>'false',
        'data'=>["email"=>$rq->email,],
        'errors'=>[
            'Message'=>'email already taken',
            'code'=>'404',
        ],

    ],404);
}
$user->password = $rq->password;
$user->name = $rq->name;
$user->email = $rq->email;
$user->save();
---
select * from `users` where `email` = '1212@2112.12312' limit 1
insert into `users` (`password`, `name`, `email`, `updated_at`, `created_at`) values ('123123123', '1212', '1212@2112.12312', '2020-02-05 08:13:37', '2020-02-05 08:13:37')

public function updatePatch(Request $rq, $id){
    $user = User::find($id);
    if($user ==null){

        return response()->json([
            'Message'=>'No content',
            'status '=> '204'
        ],200);
    }
    $users = $user->where('email' ,$rq->email)
    ->first();
---
select * from `users` where `email` is null limit 1

            'message' => 'Page Not Found.'
        ], 404);
    }else{
       $user->update($rq->all());
---
update `users` set `name` = 'qwe', `users`.`updated_at` = '2020-02-05 08:17:36' where `id` = 12

public function update(userRequest $rq,$id)
{
    $user = User::find($id);
    if(!$user){

        return response()->json([
            'Message'=>'No content',
            'status '=> '204'
        ],200);
    }
    $users = $user->where('email' ,$rq->email)
    ->first();
---
select * from `users` where `email` = 'asdasdasdasdasda@asdasdasdasd.asdasda' limit 1

            'message' => 'No content'
        ], 404);
    }else{
       $user->update($rq->all());
---
update `users` set `name` = 'asddasdasd', `email` = 'asdasdasdasdasda@asdasdasdasd.asdasda', `password` = 'asdasdasdasdasdasdasdasdasd', `users`.`updated_at` = '2020-02-05 08:16:56' where `id` = 12

public function destroy($id)
{

    $user = User::find($id);
    if(!$user){
        return response()->json([
            'status '=> 204,
            'message' => 'ko ton tai nguoi dung nay'
        ], 200);
    }
    $user->delete();
---
delete from `users` where `id` = 12